; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p14---int100n150-m25---int100c150---s260---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level14 level14)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level14 level15)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level14 level16)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level14 level17)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level14 level18)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level14 level19)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level14 level20)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level14 level21)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level14 level22)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level14 level23)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level14 level24)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level14 level25)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level14 level26)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level14 level27)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level14 level28)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level14 level29)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level14 level30)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level14 level31)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level14 level32)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level14 level33)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level14 level34)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level14 level35)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level14 level36)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level14 level37)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level14 level38)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level14 level39)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level26 level14 level40)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level27 level14 level41)
(sum level28 level7 level35)
(sum level28 level9 level37)
(sum level28 level14 level42)
(sum level29 level7 level36)
(sum level29 level9 level38)
(sum level29 level14 level43)
(sum level30 level7 level37)
(sum level30 level9 level39)
(sum level30 level14 level44)
(sum level31 level7 level38)
(sum level31 level9 level40)
(sum level31 level14 level45)
(sum level32 level7 level39)
(sum level32 level9 level41)
(sum level32 level14 level46)
(sum level33 level7 level40)
(sum level33 level9 level42)
(sum level33 level14 level47)
(sum level34 level7 level41)
(sum level34 level9 level43)
(sum level34 level14 level48)
(sum level35 level7 level42)
(sum level35 level9 level44)
(sum level36 level7 level43)
(sum level36 level9 level45)
(sum level37 level7 level44)
(sum level37 level9 level46)
(sum level38 level7 level45)
(sum level38 level9 level47)
(sum level39 level7 level46)
(sum level39 level9 level48)
(sum level40 level7 level47)
(sum level41 level7 level48)

(connected l0 l1)
(fuelcost level7 l0 l1)
(connected l0 l2)
(fuelcost level14 l0 l2)
(connected l1 l0)
(fuelcost level7 l1 l0)
(connected l1 l2)
(fuelcost level9 l1 l2)
(connected l2 l0)
(fuelcost level14 l2 l0)
(connected l2 l1)
(fuelcost level9 l2 l1)

(at t0 l2)
(fuel t0 level48)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l1)
(at p3 l0)
(at p4 l2)
(at p5 l0)
(at p6 l1)
(at p7 l1)
(at p8 l1)
(at p9 l0)
(at p10 l1)
(at p11 l1)
(at p12 l1)
(at p13 l1)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l0)
(at p3 l1)
(at p4 l1)
(at p5 l1)
(at p6 l2)
(at p7 l2)
(at p8 l0)
(at p9 l2)
(at p10 l2)
(at p11 l0)
(at p12 l0)
(at p13 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 14
2. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 14
3. (drive t0 l2 l1 level39 level9 level48)
   deleted: (at t0 l2) (fuel t0 level48)
   added: (at t0 l1) (fuel t0 level39)
   goals met: 0 of 14
4. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 1 of 14
5. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 1 of 14
6. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 14
7. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 1 of 14
8. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 1 of 14
9. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 1 of 14
10. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 1 of 14
11. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 1 of 14
12. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 1 of 14
13. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 14
14. (drive t0 l1 l0 level32 level7 level39)
   deleted: (at t0 l1) (fuel t0 level39)
   added: (at t0 l0) (fuel t0 level32)
   goals met: 1 of 14
15. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 14
16. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 1 of 14
17. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 1 of 14
18. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 14
19. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 3 of 14
20. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 4 of 14
21. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 5 of 14
22. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 6 of 14
23. (drive t0 l0 l1 level25 level7 level32)
   deleted: (at t0 l0) (fuel t0 level32)
   added: (at t0 l1) (fuel t0 level25)
   goals met: 6 of 14
24. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 7 of 14
25. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 8 of 14
26. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 9 of 14
27. (drive t0 l1 l2 level16 level9 level25)
   deleted: (at t0 l1) (fuel t0 level25)
   added: (at t0 l2) (fuel t0 level16)
   goals met: 9 of 14
28. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 10 of 14
29. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 11 of 14
30. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 12 of 14
31. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 13 of 14
32. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 14 of 14
